## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.group will be created
  + resource "azurerm_resource_group" "group" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "test-rg-actions"
    }

  # azurerm_subnet.snet will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "example-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "test-rg-actions"
      + service_endpoints                             = [
          + "Microsoft.EventHub",
        ]
      + virtual_network_name                          = "example-vnet"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "example-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "test-rg-actions"
      + subnet                         = (known after apply)
    }

  # module.primary_namespace.azurerm_eventhub.this[0] will be created
  + resource "azurerm_eventhub" "this" {
      + id                  = (known after apply)
      + message_retention   = 2
      + name                = "evh-primary-ns"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # module.primary_namespace.azurerm_eventhub.this[1] will be created
  + resource "azurerm_eventhub" "this" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-primary-ns"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 8
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # module.primary_namespace.azurerm_eventhub_namespace.ehn will be created
  + resource "azurerm_eventhub_namespace" "ehn" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 16
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "eastus"
      + minimum_tls_version                       = "1.2"
      + name                                      = "ehn-primary-ns"
      + network_rulesets                          = [
          + {
              + default_action                 = "Deny"
              + ip_rule                        = [
                  + {
                      + action  = "Allow"
                      + ip_mask = "103.59.73.254"
                    },
                ]
              + public_network_access_enabled  = true
              + trusted_service_access_enabled = true
            },
        ]
      + public_network_access_enabled             = true
      + resource_group_name                       = "test-rg-actions"
      + sku                                       = "Premium"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.primary_namespace.module.naming.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.primary_namespace.module.naming.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.primary_namespace.module.naming_eventhub.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.primary_namespace.module.naming_eventhub.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>